#+TITLE: Cloud Functions com Firebase
#+SUBTITLE: TheSubTitle
#+DESCRIPTION:
#+KEYWORDS:
#+EXPORT_FILE_NAME:
#+LANGUAGE: pt-BR
#+EXCLUDE_TAGS: noexport
#+EXPORT_EXCLUDE_TAGS: noexport
#+AUTHOR:    wagner
#+EMAIL:     wagner.marques3@etec.sp.gov.br
#+DATE:


#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:https://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export

#+LINK_UP:
#+LINK_HOME:

#+OPTIONS: H:2 toc:t

#+LaTeX_CLASS_OPTIONS: [bigger]

* Importar modulos do Fb Functions e inicializar o app
  
  Depois que de criar o seu projeto com firebase init vc tera uma
  estrutura de projeto como essa abaixo.

  Veja que temos uma pasta que chama functions. Sugestivo heinn...

  
#+NAME:   ls -l /home/wagner/fzlbpms/fzlCloud/firebase_msgsproject
#+BEGIN_SRC shell :session s1 :results output :exports both
  #ls -l /home/wagner/fzlbpms/fzlCloud/firebase_msgsproject
#+END_SRC

#+RESULTS: asdfasdf
: total 112
: -rw-rw-r--.   1 wagner wagner   714 abr 23 23:13 firebase.json
: -rw-rw-r--.   1 wagner wagner    44 abr 23 23:06 firestore.indexes.json
: -rw-rw-r--.   1 wagner wagner   687 abr 23 23:06 firestore.rules
: drwxrwxr-x.   3 wagner wagner  4096 abr 23 23:08 functions
: drwxrwxr-x. 197 wagner wagner  4096 abr 24 00:59 node_modules
: -rw-rw-r--.   1 wagner wagner 83653 abr 24 00:59 package-lock.json
: drwxrwxr-x.   2 wagner wagner  4096 abr 23 23:09 public
: -rw-rw-r--.   1 wagner wagner   138 abr 23 23:09 storage.rules

Que a gente ver o que tem dentro dessa pasta functions?


#+NAME: ls -l /home/wagner/fzlbpms/fzlCloud/firebase_msgsproject/functions
#+BEGIN_SRC shell :session s1 :results output :exports both
  #ls -l /home/wagner/fzlbpms/fzlCloud/firebase_msgsproject/functions
#+END_SRC

#+RESULTS: ls -l /home/wagner/fzlbpms/fzlCloud/firebase_msgsproject/functions
: total 136
: -rw-rw-r--.   1 wagner wagner    303 abr 23 23:07 index.js
: drwxrwxr-x. 295 wagner wagner  12288 abr 23 23:08 node_modules
: -rw-rw-r--.   1 wagner wagner    615 abr 23 23:07 package.json
: -rw-rw-r--.   1 wagner wagner 118539 abr 23 23:08 package-lock.json


Dentro da pasta functions, se vc perceber bem, tem um arquivo
package.json que he indentifica um projeto do nodejs e tem ate um
diretorio node_modules que tambem indica que esse projeto tem
dependencias.

Bom entao ja da pra perceber que essa pasta pode ser considerada um
projeto em si mesma.

E sera nesse arquivo index.js que vamos criar nossa funcao pra depois
enviar ela pro firabase funcions.

